tap "homebrew/core"

brew "autoconf"
brew "automake"
brew "aws-console"
brew "aws-shell"
brew "awscli"
brew "base64"
brew "bison"
brew "brotli"
brew "bzip2"
brew "coreutils"
brew "curl"
brew "curlie"
brew "diffstat"
brew "diffutils"
brew "dwarfutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "git"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "goenv"
brew "gpg"
brew "grep"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "irssi"
brew "jenv"
brew "jpeg"
brew "lazygit"
brew "libevent"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "m4"
brew "make"
brew "maven"
brew "mpdecimal"
brew "mpfr"
brew "mtr"
brew "neomutt"
brew "nasm"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "openssh"
brew "openssl@1.1"
brew "p7zip"
brew "pcre"
brew "pre-commit"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "rust"
brew "sha2"
brew "sha3sum"
brew "sqlite"
brew "tcping"
brew "tcptraceroute"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "w3m"
brew "watch"
brew "webp"
brew "wget"
brew "xz"
brew "zstd"

# macOS only section
if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"

  # Development tools
  cask "android-studio"
  cask "intellij-idea"
  cask "visual-studio-code"
  cask "goland"
  cask "rider"
  cask "sublime-text"
  cask "drawio"
  cask "wireshark"
  cask "ngrok"

  # Terminal tools
  cask "font-hack-nerd-font"
  cask "kitty"
  cask "xquartz"

  # Auth tools
  cask "1password"
  cask "authy"

  # Communication tools
  cask "signal"
  cask "slack"
  cask "zoom"

  # Browsers
  cask "eloston-chromium", no_quarantine: true
  cask "firefox"

  # Cloud services
  cask "mullvadvpn"
  cask "amazon-photos"
  cask "dropbox"
  cask "backblaze"
  cask "cloudapp"

  # Utilities
  cask "cakebrew"
  cask "coconutbattery"
  cask "macupdater"
  cask "keka"
  cask "microsoft-remote-desktop"

  #cask "trezor-suite"

  # Gaming
  cask "0-ad"
  cask "epic-games"
  cask "steam"
  cask "battle-net"
  cask "minecraft"
  cask "openra"

  # Virtualization / Emulation
  cask "crossover"
  cask "parallels" # For Windows
  brew "dosbox-x"

  # Anti-censorship networks
  cask "tor-browser"

  # Casks that require sudo go last
  cask "dotnet-sdk"

end

# Need different podman for Apple M1
if OS.mac? && Hardware::CPU.physical_cpu_arm64?
  tap "simnalamburt/x"
  brew "simnalamburt/x/podman-apple-silicon"
else
  brew "podman"
end

if OS.mac?
  brew "mas"
  mas "PCalc", id: 403504866
  mas "Pocket", id: 568494494
  mas "Amphetamine", id: 937984704
  mas "Xcode", id: 497799835
  mas "Remote Desktop", id: 409907375
  mas "Microsoft To Do", id: 1274495053
end
