tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "autoconf"
brew "automake"
brew "aws-console"
brew "aws-shell"
brew "awscli"
brew "base64"
brew "bison"
brew "brotli"
brew "bzip2"
brew "coreutils"
brew "curl"
brew "curlie"
brew "diffstat"
brew "diffutils"
brew "dwarfutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "git"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "goenv"
brew "gpg"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "irssi"
brew "jpeg"
brew "lazygit"
brew "libevent"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "m4"
brew "make"
brew "mpdecimal"
brew "mpfr"
brew "mtr"
brew "mutt"
brew "nasm"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "openssh"
brew "openssl@1.1"
brew "p7zip"
brew "pcre"
brew "pre-commit"
brew "pre-commit"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "rust"
brew "sha2"
brew "sha3sum"
brew "sqlite"
brew "tcping"
brew "tcptraceroute"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "w3m"
brew "watch"
brew "webp"
brew "xz"
brew "zstd"
